# -*- coding: utf-8 -*-
"""
Задание 7.2a

Сделать копию скрипта задания 7.2.

Дополнить скрипт: Скрипт не должен выводить на стандартрый поток вывода команды,
в которых содержатся слова из списка ignore.

При этом скрипт также не должен выводить строки, которые начинаются на !.

Проверить работу скрипта на конфигурационном файле config_sw1.txt.
Имя файла передается как аргумент скрипту.

Ограничение: Все задания надо выполнять используя только пройденные темы.

"""

ignore = ["duplex", "alias", "configuration"]

from sys import argv

filename=argv[1]

with open(filename,'r') as f:
    for line in f:
        if line.startswith('!'):
            continue
        else:
            ignored=False
            for command in ignore:
                if command in line:
                    ignored=True
                    break

            if ignored==False:
                print(line.rstrip())